dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
menu.storage=Storage
menu.usbcdc=USB Serial (CDC)
menu.usbdesc=USB DFU
menu.uploadmode=Upload via
menu.bootloader=Bootloader
menu.flashprofile=Flash
menu.ramprofile=SRAM
menu.buildprofile=Build Options

promicro_nrf52840.name=AliExpress ProMicro nRF52840
promicro_nrf52840.upload.tool=niusdfu
promicro_nrf52840.upload.tool.default=niusdfu
promicro_nrf52840.upload.use_1200bps_touch=false
promicro_nrf52840.upload.wait_for_upload_port=true
promicro_nrf52840.upload.protocol=dfu
# AliExpress ProMicro nRF52840 V1940 boards observed so far enumerate their
# bootloader as VID 0x239A, PID 0x00B3. That identity matches the nice!nano v2
# / clone-family UF2 bootloader layout used by several community cores rather
# than the older Nordic Open DFU values. The Auto-detect bootloader menu entry
# (default) still probes the live device at upload time, but the build and
# upload defaults below now follow the 0x00B3 family's actual flash layout.
promicro_nrf52840.upload.usb_vid=0x239A
promicro_nrf52840.upload.usb_pid=0x00B3
promicro_nrf52840.upload.dfu_alt=0
promicro_nrf52840.upload.bootloader_mode=auto
promicro_nrf52840.upload.uf2_family_id=0xADA52840
promicro_nrf52840.upload.uf2_app_start=0x26000
promicro_nrf52840.upload.adafruit_sd_req=0xFFFE
promicro_nrf52840.upload.uf2_volume_label=NICENANO
promicro_nrf52840.upload.uf2_model=nice!nano
promicro_nrf52840.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.upload.runtime_usb_pid=0x00B4
promicro_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
promicro_nrf52840.upload.maximum_size=798720
promicro_nrf52840.upload.maximum_data_size=237568
promicro_nrf52840.build.mcu=cortex-m4
promicro_nrf52840.build.f_cpu=64000000L
promicro_nrf52840.build.board=NRF52_PROMICRO_840
promicro_nrf52840.build.core=arduino
promicro_nrf52840.build.variant=promicro_nrf52840
promicro_nrf52840.build.ldscript=nrf52840_s140_compat.ld
promicro_nrf52840.build.usb_product="ProMicro nRF52840"
promicro_nrf52840.build.base_flags=-DARDUINO_NRF52_PROMICRO -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=0
promicro_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=1
promicro_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
promicro_nrf52840.build.usb_vbus_flags=-DNRF_SYSTEM_USB_ASSUME_VBUS=1
promicro_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
promicro_nrf52840.build.bootloader_fallback_flags=-DNRF_SYSTEM_BOOTLOADER_DBL_RESET_FALLBACK=1
# Upload transport stays on Adafruit serial DFU for this clone family, but
# software-triggered bootloader entry / startup rescue should land in the full
# UF2+CDC bootloader (0x57). That is the board's most reliable host-visible
# recovery state when there is no physical reset button.
promicro_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
promicro_nrf52840.build.bootloader_app_start=0x26000
promicro_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
promicro_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
promicro_nrf52840.build.debug_flags=
promicro_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
promicro_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1
promicro_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
promicro_nrf52840.build.storage_reserved_bytes=16384
promicro_nrf52840.build.usbdesc_flags=
promicro_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.usb_vbus_flags} {build.upload_mode_flags} {build.bootloader_fallback_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags} {build.usbdesc_flags}
promicro_nrf52840.menu.usbcdc.enabled=Enabled
promicro_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
promicro_nrf52840.menu.usbcdc.disabled=Disabled
promicro_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
promicro_nrf52840.menu.usbdesc.standard=Enabled
promicro_nrf52840.menu.usbdesc.standard.build.usbdesc_flags=
promicro_nrf52840.menu.usbdesc.no_app_dfu=Disabled
promicro_nrf52840.menu.usbdesc.no_app_dfu.build.usbdesc_flags=-DNRF_USB_RUNTIME_DISABLE_APP_DFU=1
promicro_nrf52840.menu.flashprofile.internal1m=1 MB internal
promicro_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
promicro_nrf52840.menu.ramprofile.sram256=256 KB
promicro_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
promicro_nrf52840.menu.uploadmode.usb=USB bootloader
promicro_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
promicro_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
promicro_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
promicro_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=false
promicro_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=true
promicro_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
promicro_nrf52840.menu.uploadmode.swd=CMSIS-DAP SWD
promicro_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
promicro_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
promicro_nrf52840.menu.uploadmode.swd.upload.protocol=swd
promicro_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
promicro_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
promicro_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
promicro_nrf52840.menu.bootloader.auto=Auto-detect (recommended)
promicro_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
promicro_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
promicro_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
promicro_nrf52840.menu.bootloader.auto.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x26000
promicro_nrf52840.menu.bootloader.auto.upload.adafruit_sd_req=0xFFFE
promicro_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.auto.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.auto.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.auto.upload.maximum_size=798720
promicro_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
promicro_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x26000
promicro_nrf52840.menu.bootloader.promicro=UF2 drive, with BLE [promicro]
promicro_nrf52840.menu.bootloader.promicro.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.promicro.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.promicro.upload.usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.promicro.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.promicro.upload.uf2_app_start=0x26000
promicro_nrf52840.menu.bootloader.promicro.upload.adafruit_sd_req=0xFFFE
promicro_nrf52840.menu.bootloader.promicro.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.promicro.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.promicro.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.promicro.upload.maximum_size=798720
promicro_nrf52840.menu.bootloader.promicro.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.promicro.build.bootloader_app_start=0x26000
promicro_nrf52840.menu.bootloader.promicrolegacy=UF2 drive, with BLE, legacy [promicrolegacy]
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.uf2_app_start=0x27000
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.adafruit_sd_req=0x0123
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.promicrolegacy.upload.maximum_size=794624
promicro_nrf52840.menu.bootloader.promicrolegacy.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.promicrolegacy.build.bootloader_app_start=0x27000
promicro_nrf52840.menu.bootloader.promicroserial=Serial DFU, with BLE [promicroserial]
promicro_nrf52840.menu.bootloader.promicroserial.upload.bootloader_mode=adafruit-dfu
promicro_nrf52840.menu.bootloader.promicroserial.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.promicroserial.upload.usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.promicroserial.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.promicroserial.upload.uf2_app_start=0x26000
promicro_nrf52840.menu.bootloader.promicroserial.upload.adafruit_sd_req=0xFFFE
promicro_nrf52840.menu.bootloader.promicroserial.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.promicroserial.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.promicroserial.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.promicroserial.upload.maximum_size=798720
promicro_nrf52840.menu.bootloader.promicroserial.upload.use_1200bps_touch=false
promicro_nrf52840.menu.bootloader.promicroserial.upload.wait_for_upload_port=false
promicro_nrf52840.menu.bootloader.promicroserial.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
promicro_nrf52840.menu.bootloader.promicroserial.build.bootloader_app_start=0x26000
promicro_nrf52840.menu.bootloader.promicroserialnosd=Serial DFU, no BLE [promicroserialnosd]
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.bootloader_mode=adafruit-dfu
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.uf2_app_start=0x1000
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.adafruit_sd_req=0xFFFE
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.runtime_usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.maximum_size=950272
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.use_1200bps_touch=false
promicro_nrf52840.menu.bootloader.promicroserialnosd.upload.wait_for_upload_port=false
promicro_nrf52840.menu.bootloader.promicroserialnosd.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1 -DNRF_USBD_POLL_ONLY=1 -DNRF_SYSTEM_RUNTIME_USB_PID=0x00B3 -DNRF_USBD_CONFIG_TIMEOUT_RESET_MS=60000 -DNRF_USBD_1200_RESET_ARM_MS=2500 -DNRF_USBD_IGNORE_INITIAL_1200_RESET_COUNT=0
promicro_nrf52840.menu.bootloader.promicroserialnosd.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
promicro_nrf52840.menu.bootloader.promicroserialnosd.build.bootloader_app_start=0x1000
promicro_nrf52840.menu.bootloader.promicroseriallegacy=Serial DFU, with BLE, legacy [promicroseriallegacy]
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.bootloader_mode=adafruit-dfu
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.usb_pid=0x00B3
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_app_start=0x27000
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.adafruit_sd_req=0x0123
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.maximum_size=794624
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.use_1200bps_touch=false
promicro_nrf52840.menu.bootloader.promicroseriallegacy.upload.wait_for_upload_port=false
promicro_nrf52840.menu.bootloader.promicroseriallegacy.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1 -DNRF_SYSTEM_BOOTLOADER_RESET_MODE=2
promicro_nrf52840.menu.bootloader.promicroseriallegacy.build.bootloader_app_start=0x27000
promicro_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2 [nicenano]
promicro_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.nicenano.upload.usb_vid=0x239A
promicro_nrf52840.menu.bootloader.nicenano.upload.usb_pid=0x0029
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
promicro_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
promicro_nrf52840.menu.bootloader.nicenano.upload.maximum_size=798720
promicro_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
promicro_nrf52840.menu.bootloader.nordicdfu=Nordic USB DFU [nordicdfu]
promicro_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x0
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
promicro_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=1032192
promicro_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
promicro_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x0
promicro_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2 [xiaouf2]
promicro_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=
promicro_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=
promicro_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=872448
promicro_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
promicro_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary UF2 [makerdiaryuf2]
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x1000
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=UF2BOOT
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=
promicro_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=1028096
promicro_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
promicro_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x1000
promicro_nrf52840.menu.buildprofile.release=Release [-Os]
promicro_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
promicro_nrf52840.menu.buildprofile.release.build.debug_flags=
promicro_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
promicro_nrf52840.menu.buildprofile.debug=Debug symbols [-Og -g3]
promicro_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
promicro_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3 -DDEBUG
promicro_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
promicro_nrf52840.menu.buildprofile.usbgdbstub=USB CDC GDB stub for IDE 2 Debug [-Og -g3]
promicro_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
promicro_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
promicro_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
# When the USB CDC GDB stub profile is selected, route Arduino IDE 2's
# debugger to our PowerShell TCP-serial bridge instead of OpenOCD/SWD.
#
# arduino-cli's `Debug` command only accepts a built-in set of server-type
# names (openocd, jlink, stutil, pyocd, bmp) — `usbgdbstub` here would be
# rejected with "GDB server 'usbgdbstub' is not supported". So we pretend
# to be openocd: keep `debug.server=openocd` (the same as other profiles)
# and override `debug.server.openocd.path` to point at our launcher EXE.
# It must be a real .exe, not a .cmd: cortex-debug spawns the server with
# Node child_process.spawn() and no shell, and modern Node throws EINVAL on
# .cmd/.bat (CVE-2024-27980), so a .cmd silently never runs (read ECONNRESET
