dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
# / "Request cancelled"). usb_gdbstub_server.exe parses the gdb_port that
# cortex-debug assigns (it owns the port; e.g. 50000) and spawns
# usb_gdbstub_bridge.ps1 on it. The bridge prints
# "Listening on port <N> for gdb connections" once its TCP socket is ready —
# that matches cortex-debug's default openocd serverReady regex, so it then
# connects GDB to localhost:<N>. One-click Debug in Arduino IDE 2 with no
# separate "start bridge" terminal.
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server=openocd
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.path={runtime.platform.path}/tools/niusrobotlab/usb_gdbstub_server.exe
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.path.windows={runtime.platform.path}\tools\niusrobotlab\usb_gdbstub_server.exe
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.scripts_dir=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.scripts_dir.windows=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.server.openocd.scripts.0=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.servertype=openocd
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.gdbTarget=localhost:3335
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.gdbPort=3335
# The stub does not implement OpenOCD `monitor` extensions. Override the
# default post-attach / restart command sequence so cortex-debug doesn't fire
# them. The target is already halted at the BKPT in setup() when GDB attaches,
# so a plain `c` is enough to resume.
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.0=set remote hardware-watchpoint-limit 0
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.1=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.2=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.postAttachCommands.3=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.overrideRestartCommands.0=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.overrideRestartCommands.1=
promicro_nrf52840.menu.buildprofile.usbgdbstub.debug.cortex-debug.custom.overrideRestartCommands.2=
promicro_nrf52840.menu.storage.log=Wear-leveling
promicro_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
promicro_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
promicro_nrf52840.menu.storage.legacy=Single-page
promicro_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
promicro_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384

nicenano_v2.name=nice!nano v2 (experimental)
nicenano_v2.upload.tool=niusdfu
nicenano_v2.upload.tool.default=niusdfu
nicenano_v2.upload.use_1200bps_touch=true
nicenano_v2.upload.wait_for_upload_port=true
nicenano_v2.upload.protocol=dfu
nicenano_v2.upload.usb_vid=0x239A
nicenano_v2.upload.usb_pid=0x00B3
nicenano_v2.upload.runtime_usb_pid=0x00B4
nicenano_v2.upload.dfu_alt=0
nicenano_v2.upload.bootloader_mode=adafruit-dfu
nicenano_v2.upload.uf2_family_id=0xADA52840
nicenano_v2.upload.uf2_app_start=0x26000
nicenano_v2.upload.adafruit_sd_req=0x00B6
nicenano_v2.upload.uf2_volume_label=NICENANO
nicenano_v2.upload.uf2_model=nice!nano
nicenano_v2.upload.uf2_board_id=nRF52840-nicenano
nicenano_v2.build.openocdscript=nrf52-cmsis-dap.cfg
nicenano_v2.upload.maximum_size=798720
nicenano_v2.upload.maximum_data_size=237568
nicenano_v2.build.mcu=cortex-m4
nicenano_v2.build.f_cpu=64000000L
nicenano_v2.build.board=NRF52_NICENANO_V2
nicenano_v2.build.core=arduino
nicenano_v2.build.variant=nicenano_v2
nicenano_v2.build.ldscript=nrf52840_s140_compat.ld
nicenano_v2.build.usb_product="nice!nano v2"
nicenano_v2.build.base_flags=-DARDUINO_NRF52_NICENANO_V2 -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_BATTERY_VDDH_DIV5=1 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
nicenano_v2.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
nicenano_v2.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
nicenano_v2.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nicenano_v2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.build.bootloader_app_start=0x26000
nicenano_v2.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
nicenano_v2.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
nicenano_v2.build.debug_flags=
nicenano_v2.build.profile_flags=-DNRF_BUILD_PROFILE=0
nicenano_v2.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1
nicenano_v2.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
nicenano_v2.build.storage_reserved_bytes=16384
nicenano_v2.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
nicenano_v2.menu.usbcdc.enabled=Enabled
nicenano_v2.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
nicenano_v2.menu.usbcdc.disabled=Disabled
nicenano_v2.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
nicenano_v2.menu.flashprofile.internal1m=Internal flash 1 MB only
nicenano_v2.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
nicenano_v2.menu.ramprofile.sram256=Internal SRAM 256 KB (fixed)
nicenano_v2.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
nicenano_v2.menu.uploadmode.usb=USB bootloader (recommended)
nicenano_v2.menu.uploadmode.usb.upload.tool=niusdfu
nicenano_v2.menu.uploadmode.usb.upload.tool.default=niusdfu
nicenano_v2.menu.uploadmode.usb.upload.protocol=dfu
nicenano_v2.menu.uploadmode.usb.upload.use_1200bps_touch=true
nicenano_v2.menu.uploadmode.usb.upload.wait_for_upload_port=true
nicenano_v2.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
nicenano_v2.menu.uploadmode.swd=CMSIS-DAP SWD
nicenano_v2.menu.uploadmode.swd.upload.tool=niusopenocd
nicenano_v2.menu.uploadmode.swd.upload.tool.default=niusopenocd
nicenano_v2.menu.uploadmode.swd.upload.protocol=swd
nicenano_v2.menu.uploadmode.swd.upload.use_1200bps_touch=false
nicenano_v2.menu.uploadmode.swd.upload.wait_for_upload_port=false
nicenano_v2.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
nicenano_v2.menu.bootloader.auto=Auto-detect (default, recommended)
nicenano_v2.menu.bootloader.auto.upload.bootloader_mode=auto
nicenano_v2.menu.bootloader.auto.upload.usb_vid=auto
nicenano_v2.menu.bootloader.auto.upload.usb_pid=auto
nicenano_v2.menu.bootloader.auto.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.auto.upload.uf2_app_start=0x26000
nicenano_v2.menu.bootloader.auto.upload.uf2_volume_label=
nicenano_v2.menu.bootloader.auto.upload.uf2_model=
nicenano_v2.menu.bootloader.auto.upload.uf2_board_id=
nicenano_v2.menu.bootloader.auto.upload.maximum_size=798720
nicenano_v2.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.auto.build.bootloader_app_start=0x26000
nicenano_v2.menu.bootloader.nicenano=nice!nano v2 UF2 (0x239A:0x0029)
nicenano_v2.menu.bootloader.nicenano.upload.bootloader_mode=uf2
nicenano_v2.menu.bootloader.nicenano.upload.usb_vid=0x239A
nicenano_v2.menu.bootloader.nicenano.upload.usb_pid=0x0029
nicenano_v2.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
nicenano_v2.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
nicenano_v2.menu.bootloader.nicenano.upload.uf2_model=nice!nano
nicenano_v2.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
nicenano_v2.menu.bootloader.nicenano.upload.maximum_size=798720
nicenano_v2.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
nicenano_v2.menu.bootloader.nordicdfu=Nordic USB DFU
nicenano_v2.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_family_id=
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_app_start=0x0
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_volume_label=
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_model=
nicenano_v2.menu.bootloader.nordicdfu.upload.uf2_board_id=
nicenano_v2.menu.bootloader.nordicdfu.upload.maximum_size=1032192
nicenano_v2.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
nicenano_v2.menu.bootloader.nordicdfu.build.bootloader_app_start=0x0
nicenano_v2.menu.bootloader.xiaouf2=Seeed XIAO UF2
nicenano_v2.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_volume_label=
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_model=
nicenano_v2.menu.bootloader.xiaouf2.upload.uf2_board_id=
nicenano_v2.menu.bootloader.xiaouf2.upload.maximum_size=872448
nicenano_v2.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
nicenano_v2.menu.bootloader.makerdiaryuf2=MakerDiary UF2
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x1000
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=UF2BOOT
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_model=
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=
nicenano_v2.menu.bootloader.makerdiaryuf2.upload.maximum_size=1028096
nicenano_v2.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
nicenano_v2.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x1000
nicenano_v2.menu.buildprofile.release=Release (-Os)
nicenano_v2.menu.buildprofile.release.compiler.optimization_flags=-Os
nicenano_v2.menu.buildprofile.release.build.debug_flags=
nicenano_v2.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
nicenano_v2.menu.buildprofile.debug=Debug symbols (-Og -g3)
nicenano_v2.menu.buildprofile.debug.compiler.optimization_flags=-Og
nicenano_v2.menu.buildprofile.debug.build.debug_flags=-g3
nicenano_v2.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
nicenano_v2.menu.buildprofile.usbgdbstub=USB CDC GDB stub (-Og -g3)
nicenano_v2.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
nicenano_v2.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
nicenano_v2.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
nicenano_v2.menu.storage.log=Log-structured wear leveling
nicenano_v2.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
nicenano_v2.menu.storage.log.build.storage_reserved_bytes=16384
nicenano_v2.menu.storage.legacy=Legacy single-page
nicenano_v2.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
nicenano_v2.menu.storage.legacy.build.storage_reserved_bytes=16384

