dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
pitaya_go_nrf52840.name=Pitaya Go nRF52840
pitaya_go_nrf52840.upload.tool=niusdfu
pitaya_go_nrf52840.upload.tool.default=niusdfu
pitaya_go_nrf52840.upload.use_1200bps_touch=true
pitaya_go_nrf52840.upload.wait_for_upload_port=true
pitaya_go_nrf52840.upload.protocol=dfu
pitaya_go_nrf52840.upload.usb_vid=0x2886
pitaya_go_nrf52840.upload.usb_pid=0xF00E
pitaya_go_nrf52840.upload.runtime_usb_pid=0xF00E
pitaya_go_nrf52840.upload.dfu_alt=0
pitaya_go_nrf52840.upload.bootloader_mode=adafruit-dfu
pitaya_go_nrf52840.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.upload.uf2_app_start=0x26000
pitaya_go_nrf52840.upload.uf2_volume_label=PITAYAGO
pitaya_go_nrf52840.upload.uf2_model=Makerdiary Pitaya Go
pitaya_go_nrf52840.upload.uf2_board_id=PITAYAGO
pitaya_go_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
pitaya_go_nrf52840.upload.maximum_size=1032192
pitaya_go_nrf52840.upload.maximum_data_size=262144
pitaya_go_nrf52840.build.mcu=cortex-m4
pitaya_go_nrf52840.build.f_cpu=64000000L
pitaya_go_nrf52840.build.board=NRF52_PITAYA_GO
pitaya_go_nrf52840.build.core=arduino
pitaya_go_nrf52840.build.variant=pitaya_go_nrf52840
pitaya_go_nrf52840.build.ldscript=nrf52840.ld
pitaya_go_nrf52840.build.usb_product="Pitaya Go nRF52840"
pitaya_go_nrf52840.build.base_flags=-DARDUINO_NRF52_PITAYA_GO -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=1 -DNRF_BOARD_HAS_WIFI=1 -DNRF_BOARD_HAS_IMU=1 -DNRF_BOARD_HAS_NFC=0
pitaya_go_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=0
pitaya_go_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
pitaya_go_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
pitaya_go_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
pitaya_go_nrf52840.build.bootloader_app_start=0x0
pitaya_go_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=3 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
pitaya_go_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
pitaya_go_nrf52840.build.debug_flags=
pitaya_go_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
pitaya_go_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1
pitaya_go_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
pitaya_go_nrf52840.build.storage_reserved_bytes=16384
pitaya_go_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
pitaya_go_nrf52840.menu.usbcdc.enabled=Enabled
pitaya_go_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
pitaya_go_nrf52840.menu.usbcdc.disabled=Disabled
pitaya_go_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
pitaya_go_nrf52840.menu.flashprofile.qspi=Internal 1 MB + QSPI (capacity unverified)
pitaya_go_nrf52840.menu.flashprofile.qspi.build.flash_flags=-DNRF_BOARD_HAS_QSPI=1 -DNRF_BOARD_FLASH_PROFILE=3 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
pitaya_go_nrf52840.menu.flashprofile.internal1m=Internal flash 1 MB only (clone override)
pitaya_go_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
pitaya_go_nrf52840.menu.ramprofile.sram256=Internal SRAM 256 KB (fixed)
pitaya_go_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
pitaya_go_nrf52840.menu.uploadmode.usb=USB bootloader (recommended)
pitaya_go_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
pitaya_go_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
pitaya_go_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
pitaya_go_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=true
pitaya_go_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=true
pitaya_go_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
pitaya_go_nrf52840.menu.uploadmode.swd=CMSIS-DAP SWD
pitaya_go_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
pitaya_go_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
pitaya_go_nrf52840.menu.uploadmode.swd.upload.protocol=swd
pitaya_go_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
pitaya_go_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
pitaya_go_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
pitaya_go_nrf52840.menu.bootloader.auto=Auto-detect (default, recommended)
pitaya_go_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
pitaya_go_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
pitaya_go_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_family_id=
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x0
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_model=
pitaya_go_nrf52840.menu.bootloader.auto.upload.uf2_board_id=
pitaya_go_nrf52840.menu.bootloader.auto.upload.maximum_size=1032192
pitaya_go_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
pitaya_go_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x0
pitaya_go_nrf52840.menu.bootloader.nordicdfu=Nordic USB DFU (0x1915:0x5284)
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x0
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
pitaya_go_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=1032192
pitaya_go_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
pitaya_go_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x0
pitaya_go_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
pitaya_go_nrf52840.menu.bootloader.nicenano.upload.maximum_size=876544
pitaya_go_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
pitaya_go_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
pitaya_go_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=
pitaya_go_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=872448
pitaya_go_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
pitaya_go_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary UF2
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x1000
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=UF2BOOT
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=1028096
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
pitaya_go_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x1000
pitaya_go_nrf52840.menu.buildprofile.release=Release (-Os)
pitaya_go_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
pitaya_go_nrf52840.menu.buildprofile.release.build.debug_flags=
pitaya_go_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
pitaya_go_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
pitaya_go_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
pitaya_go_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3
pitaya_go_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
pitaya_go_nrf52840.menu.buildprofile.usbgdbstub=USB CDC GDB stub (-Og -g3)
pitaya_go_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
pitaya_go_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
pitaya_go_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
pitaya_go_nrf52840.menu.storage.log=Log-structured wear leveling
pitaya_go_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
pitaya_go_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
pitaya_go_nrf52840.menu.storage.legacy=Legacy single-page
pitaya_go_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
pitaya_go_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384

