dunknowcoding/ArduinoNRF/hardware/arduinonrf/nrf52/boards.txt
usb_dongle_nrf52840.name=nRF52840 USB Dongle (PCA10059 - Nordic Open DFU)
usb_dongle_nrf52840.upload.tool=niusdfu
usb_dongle_nrf52840.upload.tool.default=niusdfu
usb_dongle_nrf52840.upload.use_1200bps_touch=false
usb_dongle_nrf52840.upload.wait_for_upload_port=true
usb_dongle_nrf52840.upload.protocol=nordic-dfu
usb_dongle_nrf52840.upload.usb_vid=0x1915
usb_dongle_nrf52840.upload.usb_pid=0x521F
usb_dongle_nrf52840.upload.dfu_alt=0
usb_dongle_nrf52840.upload.bootloader_mode=nordic-dfu
usb_dongle_nrf52840.upload.uf2_family_id=
usb_dongle_nrf52840.upload.uf2_app_start=0x1000
usb_dongle_nrf52840.upload.uf2_volume_label=
usb_dongle_nrf52840.upload.uf2_model=
usb_dongle_nrf52840.upload.uf2_board_id=
usb_dongle_nrf52840.build.openocdscript=nrf52-cmsis-dap.cfg
usb_dongle_nrf52840.upload.maximum_size=1028096
usb_dongle_nrf52840.upload.maximum_data_size=262144
usb_dongle_nrf52840.build.mcu=cortex-m4
usb_dongle_nrf52840.build.f_cpu=64000000L
usb_dongle_nrf52840.build.board=NRF52_DONGLE_840
usb_dongle_nrf52840.build.core=arduino
usb_dongle_nrf52840.build.variant=usb_dongle_nrf52840
usb_dongle_nrf52840.build.ldscript=nrf52840.ld
usb_dongle_nrf52840.build.usb_product="nRF52840 USB Dongle"
usb_dongle_nrf52840.build.base_flags=-DARDUINO_NRF52_USB_DONGLE -DNRF_BOARD_HAS_NATIVE_USB=1 -DNRF_BOARD_HAS_BATTERY=0 -DNRF_BOARD_HAS_WIFI=0 -DNRF_BOARD_HAS_IMU=0 -DNRF_BOARD_HAS_NFC=1
usb_dongle_nrf52840.build.system_flags=-DNRF_SYSTEM_HAS_SWD=1 -DNRF_SYSTEM_DEBUG_PADS_ONLY=1
usb_dongle_nrf52840.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
usb_dongle_nrf52840.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
usb_dongle_nrf52840.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
usb_dongle_nrf52840.build.bootloader_app_start=0x1000
usb_dongle_nrf52840.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
usb_dongle_nrf52840.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
usb_dongle_nrf52840.build.debug_flags=
usb_dongle_nrf52840.build.profile_flags=-DNRF_BUILD_PROFILE=0
usb_dongle_nrf52840.build.usb_backend_flags=-DNRF_SYSTEM_USB_BACKEND=1
usb_dongle_nrf52840.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
usb_dongle_nrf52840.build.storage_reserved_bytes=16384
usb_dongle_nrf52840.build.extra_flags={build.base_flags} {build.system_flags} {build.usb_backend_flags} {build.storage_flags} {build.usb_cdc_flags} {build.upload_mode_flags} {build.bootloader_flags} {build.flash_flags} {build.ram_flags} {build.profile_flags} {build.debug_flags}
usb_dongle_nrf52840.menu.usbcdc.enabled=Enabled
usb_dongle_nrf52840.menu.usbcdc.enabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=1 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=1
usb_dongle_nrf52840.menu.usbcdc.disabled=Disabled
usb_dongle_nrf52840.menu.usbcdc.disabled.build.usb_cdc_flags=-DNRF_SYSTEM_HAS_USB_CDC=0 -DNRF_SYSTEM_DEFAULT_SERIAL_USB=0
usb_dongle_nrf52840.menu.flashprofile.internal1m=Internal flash 1 MB only
usb_dongle_nrf52840.menu.flashprofile.internal1m.build.flash_flags=-DNRF_BOARD_HAS_QSPI=0 -DNRF_BOARD_FLASH_PROFILE=2 -DNRF_BOARD_PROGRAM_FLASH_BYTES={upload.maximum_size}
usb_dongle_nrf52840.menu.ramprofile.sram256=Internal SRAM 256 KB (fixed)
usb_dongle_nrf52840.menu.ramprofile.sram256.build.ram_flags=-DNRF_BOARD_RAM_PROFILE=2 -DNRF_BOARD_DATA_RAM_BYTES={upload.maximum_data_size}
usb_dongle_nrf52840.menu.uploadmode.usb=USB bootloader (recommended)
usb_dongle_nrf52840.menu.uploadmode.usb.upload.tool=niusdfu
usb_dongle_nrf52840.menu.uploadmode.usb.upload.tool.default=niusdfu
usb_dongle_nrf52840.menu.uploadmode.usb.upload.protocol=dfu
usb_dongle_nrf52840.menu.uploadmode.usb.upload.use_1200bps_touch=true
usb_dongle_nrf52840.menu.uploadmode.usb.upload.wait_for_upload_port=true
usb_dongle_nrf52840.menu.uploadmode.usb.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=1
usb_dongle_nrf52840.menu.uploadmode.swd=CMSIS-DAP SWD
usb_dongle_nrf52840.menu.uploadmode.swd.upload.tool=niusopenocd
usb_dongle_nrf52840.menu.uploadmode.swd.upload.tool.default=niusopenocd
usb_dongle_nrf52840.menu.uploadmode.swd.upload.protocol=swd
usb_dongle_nrf52840.menu.uploadmode.swd.upload.use_1200bps_touch=false
usb_dongle_nrf52840.menu.uploadmode.swd.upload.wait_for_upload_port=false
usb_dongle_nrf52840.menu.uploadmode.swd.build.upload_mode_flags=-DNRF_SYSTEM_USB_UPLOAD_PREFERRED=0
usb_dongle_nrf52840.menu.bootloader.auto=Auto-detect (default, recommended)
usb_dongle_nrf52840.menu.bootloader.auto.upload.bootloader_mode=auto
usb_dongle_nrf52840.menu.bootloader.auto.upload.usb_vid=auto
usb_dongle_nrf52840.menu.bootloader.auto.upload.usb_pid=auto
usb_dongle_nrf52840.menu.bootloader.auto.upload.uf2_family_id=0xADA52840
usb_dongle_nrf52840.menu.bootloader.auto.upload.uf2_app_start=0x1000
usb_dongle_nrf52840.menu.bootloader.auto.upload.uf2_volume_label=
usb_dongle_nrf52840.menu.bootloader.auto.upload.uf2_model=
usb_dongle_nrf52840.menu.bootloader.auto.upload.uf2_board_id=
usb_dongle_nrf52840.menu.bootloader.auto.upload.maximum_size=1028096
usb_dongle_nrf52840.menu.bootloader.auto.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
usb_dongle_nrf52840.menu.bootloader.auto.build.bootloader_app_start=0x1000
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2=MakerDiary UF2 (0xADA52840)
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.upload.bootloader_mode=uf2
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_family_id=0xADA52840
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_app_start=0x1000
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_volume_label=UF2BOOT
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_model=
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.upload.uf2_board_id=
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.upload.maximum_size=1028096
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
usb_dongle_nrf52840.menu.bootloader.makerdiaryuf2.build.bootloader_app_start=0x1000
usb_dongle_nrf52840.menu.bootloader.nordicdfu=Nordic USB DFU
usb_dongle_nrf52840.menu.bootloader.nordicdfu.upload.bootloader_mode=nordic-dfu
usb_dongle_nrf52840.menu.bootloader.nordicdfu.upload.uf2_family_id=
usb_dongle_nrf52840.menu.bootloader.nordicdfu.upload.uf2_app_start=0x0
usb_dongle_nrf52840.menu.bootloader.nordicdfu.upload.uf2_volume_label=
usb_dongle_nrf52840.menu.bootloader.nordicdfu.upload.uf2_model=
usb_dongle_nrf52840.menu.bootloader.nordicdfu.upload.uf2_board_id=
usb_dongle_nrf52840.menu.bootloader.nordicdfu.upload.maximum_size=1032192
usb_dongle_nrf52840.menu.bootloader.nordicdfu.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=1
usb_dongle_nrf52840.menu.bootloader.nordicdfu.build.bootloader_app_start=0x0
usb_dongle_nrf52840.menu.bootloader.nicenano=nice!nano v2 UF2
usb_dongle_nrf52840.menu.bootloader.nicenano.upload.bootloader_mode=uf2
usb_dongle_nrf52840.menu.bootloader.nicenano.upload.uf2_family_id=0xADA52840
usb_dongle_nrf52840.menu.bootloader.nicenano.upload.uf2_app_start=0x26000
usb_dongle_nrf52840.menu.bootloader.nicenano.upload.uf2_volume_label=NICENANO
usb_dongle_nrf52840.menu.bootloader.nicenano.upload.uf2_model=nice!nano
usb_dongle_nrf52840.menu.bootloader.nicenano.upload.uf2_board_id=nRF52840-nicenano
usb_dongle_nrf52840.menu.bootloader.nicenano.upload.maximum_size=876544
usb_dongle_nrf52840.menu.bootloader.nicenano.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
usb_dongle_nrf52840.menu.bootloader.nicenano.build.bootloader_app_start=0x26000
usb_dongle_nrf52840.menu.bootloader.xiaouf2=Seeed XIAO UF2
usb_dongle_nrf52840.menu.bootloader.xiaouf2.upload.bootloader_mode=uf2
usb_dongle_nrf52840.menu.bootloader.xiaouf2.upload.uf2_family_id=0xADA52840
usb_dongle_nrf52840.menu.bootloader.xiaouf2.upload.uf2_app_start=0x27000
usb_dongle_nrf52840.menu.bootloader.xiaouf2.upload.uf2_volume_label=
usb_dongle_nrf52840.menu.bootloader.xiaouf2.upload.uf2_model=
usb_dongle_nrf52840.menu.bootloader.xiaouf2.upload.uf2_board_id=
usb_dongle_nrf52840.menu.bootloader.xiaouf2.upload.maximum_size=872448
usb_dongle_nrf52840.menu.bootloader.xiaouf2.build.bootloader_flags=-DNRF_SYSTEM_BOOTLOADER_MODE=2
usb_dongle_nrf52840.menu.bootloader.xiaouf2.build.bootloader_app_start=0x27000
usb_dongle_nrf52840.menu.buildprofile.release=Release (-Os)
usb_dongle_nrf52840.menu.buildprofile.release.compiler.optimization_flags=-Os
usb_dongle_nrf52840.menu.buildprofile.release.build.debug_flags=
usb_dongle_nrf52840.menu.buildprofile.release.build.profile_flags=-DNRF_BUILD_PROFILE=0
usb_dongle_nrf52840.menu.buildprofile.debug=Debug symbols (-Og -g3)
usb_dongle_nrf52840.menu.buildprofile.debug.compiler.optimization_flags=-Og
usb_dongle_nrf52840.menu.buildprofile.debug.build.debug_flags=-g3
usb_dongle_nrf52840.menu.buildprofile.debug.build.profile_flags=-DNRF_BUILD_PROFILE=1
usb_dongle_nrf52840.menu.buildprofile.usbgdbstub=USB CDC GDB stub (-Og -g3)
usb_dongle_nrf52840.menu.buildprofile.usbgdbstub.compiler.optimization_flags=-Og
usb_dongle_nrf52840.menu.buildprofile.usbgdbstub.build.debug_flags=-g3
usb_dongle_nrf52840.menu.buildprofile.usbgdbstub.build.profile_flags=-DNRF_BUILD_PROFILE=2 -DNRF_SYSTEM_USB_GDB_STUB=1
usb_dongle_nrf52840.menu.storage.log=Log-structured wear leveling
usb_dongle_nrf52840.menu.storage.log.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=2 -DNRF_STORAGE_REGION_BYTES=16384
usb_dongle_nrf52840.menu.storage.log.build.storage_reserved_bytes=16384
usb_dongle_nrf52840.menu.storage.legacy=Legacy single-page
usb_dongle_nrf52840.menu.storage.legacy.build.storage_flags=-DNRF_SYSTEM_STORAGE_BACKEND=1 -DNRF_STORAGE_REGION_BYTES=16384
usb_dongle_nrf52840.menu.storage.legacy.build.storage_reserved_bytes=16384
